kaorii-ako/Poket/firmware/sdkconfig.defaults
# ---- Poket: ESP32-WROOM-32E-R2 (16 MB flash, 2 MB in-package PSRAM) ----
# REV B. The S3 could not do A2DP - it has no BR/EDR radio at all.
CONFIG_IDF_TARGET="esp32"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 2 MB PSRAM, in the SoC package on the -R2 - so unlike a WROVER it does not
# take GPIO16/17. Decode buffers and the A2DP ring live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# No native USB on this part: the console goes out UART0 to a CP2102N.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Classic Bluetooth for A2DP source. BLE is not used, and turning it off buys
# back a useful chunk of RAM on a part that only has 520 kB of it.
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_SPP_ENABLED=n
CONFIG_BT_BLE_ENABLED=n

# WiFi: only ever up in transfer mode, see net/wifi.c for why.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_UTF8=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
